Revit 2024 API
PointOnPlane.Offset Property
Signed offset from the plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Offset { get; set; }
Visual Basic
Public Property Offset As Double
	Get
	Set
Visual C++
public:
property double Offset {
	double get ();
	void set (double value);
}
Remarks
The point's position is offset in the direction of the normal vector returned by the Plane.Normal property.
See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace